import java.util.Random;

class question_11{
    //class like question_1
    public question_11(){}
    public static Question[] question_11_array() {
        Question[] questions=new Question[10];
        questions[0] =new  Question("Այս անձանցից ով է 2 անգամ արժանացել Նոբելյան մրցանակի",
                "Պոլինգ", "Ռոզինգ","Քրիկ","Վանտ Հոֆ", "a");
        questions[1] =new  Question("Որ շինության անվանումից է կազմել մի իտալացի հետևյալ անագրաման ՝ <<Capi mal until>> , ինչը նշաակում է <<Անհաջող միավորված գլուխներ>>",
                "Պիզայի աշտարակի ", "Կապիտոլիումի","Մունիցիպալիտետի","Կոլիզեի", "c");
        questions[2] =new  Question("<<․․․ դարպասների մոտ է>>։ Թևավոր դարձած այս խոսքը գործածվում է իբրև կոչ՝ համախմբվելու և մահացու վտանգը դիմակայելու համար։ Ամբողջացրեք խոսքը",
                "Հաննիբալը", "Կեսարը","Չինգիզ խանը","Մակեդոնացին", "a");
        questions[3] =new  Question("Ինչպես է կոչվում Խաղաղ օվկիանոսյան ավազանի կղզիներից մեկի անվանումը, որը անվանվել է իր հայտնաբերման օրվա անունով",
                "Ամանորի կղզի", "Զատիկի կղզի", "Վալենտինի կղզի","Հաղթանակի կղզի", "b");
        questions[4] =new  Question("Ում վրձնին է պատկանում <<Ջոկոնդան>>", "Լեոնարդո դա Վինչի", "Ռաֆայել",
                "Պաբլո Պիկասո","Պաբլո Վերոնեզե", "c");
        questions[5] =new  Question("Ա․ Պոպ <<Ամեն մարդ տարբերվում է ուրիշներից և օր օրի ․․․․․ >>",
                "Փոփոխվում է", "Տարբերվում է իրենից", "Նմանվում է ուիշին","Տարբերվում է ավելի շատ", "b");
        questions[6] =new  Question("Անանիա Շիրակացի <<Չկա ոչինչ, որ կարելի չլինի բացատրել և չկա ոչինչ, որ անմատչելի լինի ․․․․․․․․>>",
                "մարդկությանը", "քեզ", "բանականությանը","ինձ", "c");
        questions[7] =new  Question("Մովսես Խորենացի <<Մարդու փրկագինը իր ․․․․․․․>>",
                "ընտանիքն է", "հարստությունն է", "գործն ","պատմությունն է", "b");
        questions[8] =new  Question("Ֆրանս <<Երբ սկսում ես խորհել, ամեն բան դառնում է ․․․․․>>",
                "հասկանալի", "պարզ", "դժվար","խճճված", "c");
        questions[9] =new  Question("Հերդեր <<Առածները ժողովրդի մտքերի ․․․․․․ >>",
                "գրակվականն են", "հայելին են", "նշաններն են","ապագան են", "b");
        return questions;
    }
    public static Question random_question_11(){
        Random rand = new Random();
        int index = rand.nextInt(10);
        System.out.println("Տասնմեկերորդ հարց, 500000 դրամ\n");
        return question_11_array()[index];
    }
}
