import java.util.Random;

class question_14{
    //class like question_1
    public question_14(){}
    public static Question[] question_14_array() {
        Question[] questions=new Question[10];
        questions[0] =new  Question("Եվ Լինկոլնի, և Քենեդու սպանություններից հետո պաշտոնավարել է նույն ազգանունով նախագահը",
                "Ֆորդ", "Ջոնսոն","Նիքսոն","Քարտեր", "b");
        questions[1] =new  Question("Բեռնարդ Շոուն որ պիեսի համար է 1925 թվականին արժանացել Նոբելյան մրցանակի",
                "Սուրբ Իոհաննա", "Պիգմալիոն","Կեսարը և Կլեոպատրան","Անդրոկլեսն ու առյուծը", "a");
        questions[2] =new  Question("Տարբերակներից մեկը բառացիորեն թարգմանվում է <<սև գլխարկավոր>>",
                "Ղպչակ", "Կարաչայ","Կարակալպակ","Կարակում", "c");
        questions[3] =new  Question("Արիստոտել Օնասիս <<Ես չունեմ ոչ ընկերներ, ոչ թշնամիներ, ունեմ միայն ․․․․․․>>",
                "Բարեկամներ", "Գործընկերներ", "Մրցակիցներ","Չուզողներ", "c");
        questions[4] =new  Question("Նշված երգարաններից որը կսմիթավոր չէ", "Փանդիռ", "Փանդուրի",
                "Բանդուրա","Սանթուր", "d");
        questions[5] =new  Question("18-րդ դարում Անգլիական բուրժուական հեղափոխության ժամանակ կազմավորված <<հավասարարների>> կուսակցություն",
                "Պարիստետներ", "Ինդեփենդենտներ", "Լևելլերներ","Յուվելերներ", "c");
        questions[6] =new  Question("Ում անունը հին գերմաներեն <<նիզակ>> չի նշանակում",
                "Ֆ․ Ռայկարդ", "Ֆ․Ձեֆիրելլի", "Ֆ․ Շուբերտ","Ֆ․Մենդելսոն", "d");
        questions[7] =new  Question("Նշված տարբերակներից երեքը թե սարքի, և թե համաստղության անվանումներ են, մեկը ոչ",
                "Մանրադիտակ", "Քանոն", "Կողմնացույց","Պոմպ", "b");
        questions[8] =new  Question("Ըստ Չերչիլի՝ ինչն է օգտակար, հատկապես, եթե այն արել են ձեր ծնողները",
                "Դրամ կուտակելը", "Մեքենա գնելը", "Խելք հավաքելը","Սիրահարվելը", "a");
        questions[9] =new  Question("Երաժշական տերմին, որը նշանակում է հնչողության հետզգետե թուլացում",
                "Ritenuto", "Ritardanto", "Crescendo","Diminuendo", "d");
        return questions;
    }
    public static Question random_question_14(){
        Random rand = new Random();
        int index = rand.nextInt(10);
        System.out.println("Տասնչորսերորդ հարց, 3000000 դրամ\n");
        return question_14_array()[index];
    }
}