import java.util.Random;

class question_8{
    //class like question_1
    public question_8(){}
    public static Question[] question_8_array() {
        Question[] questions=new Question[10];
        questions[0] =new  Question("350 թվականին տանուլ տալով Ոսխայի ճակատամարտում ՝ Շապուհ II-ը գերությունից ազատեց Տիրանինմ ով գահը զիջեց հօգուտ որդու՝",
                "Տիգրան Գ-ի", "Տիգրան Բ-ի","Արշակ Բ-ի","Պապի", "c");
        questions[1] =new  Question("Ինչի մասին է Թումայանը ասել՝ <<Դրանք շատ ուժեղ շտրիխներ են, իմ հոգու կենսագրություններն են",
                "Պոեմներ", "Բալլադներ","Քառյակներ","Հեքիաթներ", "c");
        questions[2] =new  Question("Գերմանական դասական գրականության հիմնադիրներից մեկը համարվում է",
                "Մյուլերը", "Շիլլերը","Շուբերտը","Ռեմարկը", "b");
        questions[3] =new  Question("Կոնֆուցիոս <<Բարուն պետք է պատասխանել բարությամբ , իսկ չարին ․․․․․․․․․>>",
                "Չարությամբ", "Համբերությամբ", "Արդարամտությամբ","Ողջամտությամբ", "c");
        questions[4] =new  Question("Ձայն արձակող ապար", "Ֆոնոլիթ", "Ֆոտոլիթ",
                "Ֆիտոլիթ","Մոնոլիթ", "a");
        questions[5] =new  Question("Ք․ա․ առաջին հազարամյակից մինչը առաջին դարը Կասպից ծովի հարավարևելյան մասում բնակվել են",
                "Սկյութները", "Պարիաները", "Արաբները","Պարթևները", "d");
        questions[6] =new  Question("Բջջանամության բաժին է",
                "Կորիզաբանություն", "Խորիզաբանություն", "Խարիզմաբանություն","Բնապահպանություն", "a");
        questions[7] =new  Question("Քիմիական տարրի անվանում",
                "Դեյտերիում", "Տրիտիում", "Տրոտիլիում","Թուլիում", "d");
        questions[8] =new  Question("Կանադացի բժիշկ-ախտաբան, ով ձևակերպել է սթրեսի տեսությունը",
                "Լևերիե", "Մելյե", "Սելյե","Սոմելյի", "c");
        questions[9] =new  Question("<<Մենավոր ընկուզենին>> ֆիլմում ում թաղման ժամանակ քաշկռտուք սարքեցին Լեռկամսարի բնակիչները",
                "Լառ-Մարգար", "Լաքա Սիրակի", "Կաղ Լենդրուշի","Աբու Հասակի", "b");
        return questions;
    }
    public static Question random_question_8(){
        Random rand = new Random();
        int index = rand.nextInt(10);
        System.out.println("Ութերորդ հարց, 64000 դրամ\n");
        return question_8_array()[index];
    }
}