import java.util.Random;

class question_10{
    //class like question_1
    public question_10(){}
    public static Question[] question_10_array() {
        Question[] questions=new Question[10];
        questions[0] =new  Question("<<Ինչու է աղմկում գետը>> ֆիլմում հնչում է նրա երաժշտությունը",
                "Է․Միրզոյան", "Ա․ Բաբաջանյան","Ա․Այվազյան","Տ․Մանսուրյան", "c");
        questions[1] =new  Question("Խորհրդային ականավոր զորավարներից ով է դարձել Լեհաստանի Ազգային պաշտպանության նախարար",
                "Բլյուխեր", "Մալինովսկի","Ռոկոսովսկի","Տուխաչևսկի", "c");
        questions[2] =new  Question("Որ ֆիլմին է շնորհվել Վենետիկի 65-րդ փառատոնի գլխավոր մրցանակը",
                "Մարտիկը", "Թղթե զինվորը","Զինվորի հույսը","Զինվորի գրիչը", "a");
        questions[3] =new  Question("Այդ ֆրանսիացի նշանավոր հայագետը հրատարակել է Եղիշեյի, Փավստեց Բուզանդի և այլոց գործերը ",
                "Լակրուս", "Լանգլուս", "Լասսել","Լյուլի", "b");
        questions[4] =new  Question("Հույները և իտալացիները դա անվանում են բազիլիկ, իսկ հայերը՝․․․․․․․",
                "Վազելին", "Նազելի", "Ռեհան","Բողկ", "c");
        questions[5] =new  Question("Բիսմարկ․ <<Հաղթողը թողնում է միայն պարտվողի աչքերը, որպեսզի նա կարողանա>>",
                "Իրեն տեսնել", "Լաց լինել", "Իրեն չտեսնել","Փակել դրանք", "b");
        questions[6] =new  Question("Նշվածներից ով չի առընչվել <<հռոմեացու>> հետ",
                "Աբրամովիչը", "Բերեզովսկին", "Կրուտոյը","Կարցևը", "c");
        questions[7] =new  Question("Բոլոր բառերը կապված են ձյուդոյի հետ։ Որն է նաև պարագվայական թեյ է ",
                "Յուկա", "Մատե", "Տատամի","Իպոն", "b");
        questions[8] =new  Question("Որ թիմի դեմ 2013 թվականին ՉԼ-ում պոկերի հեղինակ դարձավ Ռոբերտ Լևանդովսկին",
                "Բավարիա", "Չելսի", "Ռեալ Մադրիդ","Մալագա", "c");
        questions[9] =new  Question("Ով է ճանաչվել 2010 թվականի աշխարհի ֆուտբոլի առաջնության ամենատգեղ ֆուտբոլիստ",
                "Ֆորլան", "Ուեյն Ռունի", "Չավի","Բուֆֆոն", "b");
        return questions;
    }
    public static Question random_question_10(){
        Random rand = new Random();
        int index = rand.nextInt(10);
        System.out.println("Տասներորդ հարց, 250000 դրամ, երկրորդ անձեռնամխելի գումարը\n");
        return question_10_array()[index];
    }
}