import java.util.Random;

class question_9{
    //class like question_1
    public question_9(){}
    public static Question[] question_9_array() {
        Question[] questions=new Question[10];
        questions[0] =new  Question("Ինչ կենդանի է Ջեկ Լոնդոնի <<Նախկինների կանչը>> վեպի գլխավոր հերոսը",
                "Դելֆի", "Շուն","Յագուար","Կապիկ", "b");
        questions[1] =new  Question("Ով էր Հեղինեյի ամուսինը",
                "Պարիսը", "Մենելաոսը","Ագամեմնոնը","Էգիսթոսը", "b");
        questions[2] =new  Question("Ըստ ֆրանսիացի գրող Ստենդալի՝ միայն ինչը կարող է փոխարինել գեղեցկությանը",
                "Վառ երևակայությունը", "Համեստությունը","Մտքի ճկունությունը","Շքեղ հագուստը", "b");
        questions[3] =new  Question("13-15րդ դարերում ինչպիսի պետություն է Իսպանիայի տարածքում գտնվող Գրանադան",
                "Թեոկրատական", "Մուսուլմանական", "Դեմոկրատական","Ստրկատիրական", "b");
        questions[4] =new  Question("Բրեխտի այդ օպերան <<արժեր>> ընդամենը երեք ․․․․․․", "Ցենտ", "Պենս",
                "Գրոշ","Դրամ", "c");
        questions[5] =new  Question("Թեյի տերևների փաթեթավորման համար նախատեսված մեքենան կոչվում է ",
                "Տոստեր", "Մոններ", "Ռոլլեր","Մաններ", "c");
        questions[6] =new  Question("<<Կալևալա>> ժողովրդական էպոսն այդ ժողովուրդներինն է",
                "Չեչեն-ինգուշական", "Յամալո-նենեցկյան", "Կարելլա-ֆիննական","Հայ-պարսկական", "c");
        questions[7] =new  Question("<<Ծանր>> հոտ անուն ունեցող նյութերը լատիներեն այդ անունն են կրում",
                "Gravus", "Infirmus", "Infitus","Brabus", "a");
        questions[8] =new  Question("Մեկ խաղում ֆուտբոլիստի խփած 4 գոլը կոչվում է",
                "Պենտատրիկ", "Պենտա-կվայտ", "Դուբլ ","Պոկեր", "d");
        questions[9] =new  Question("Ում գլխավորւթյամբ է Լոնդոնի Չելսին առաջին անգամ հաղթել ՉԼ-ն",
                "ՊԵպ Գվարդիոլա", "Պիրլո", "Սեր Ալեքս Ֆերգյուսոն","Ռոբերտո Դի Մատեո", "d");
        return questions;
    }
    public static Question random_question_9(){
        Random rand = new Random();
        int index = rand.nextInt(10);
        System.out.println("Իններորդ հարց, 125000 դրամ\n");
        return question_9_array()[index];
    }
}