import java.util.Random;

class question_12{
    //class like question_1
    public question_12(){}
    public static Question[] question_12_array() {
        Question[] questions=new Question[10];
        questions[0] =new  Question("Չիմանալով ճիշտ պատասխանը, ինչքան է տվյալ հարցում ճիշտ պատասխանելու հավանականությունը",
                "50%", "25%","25%","0%", "a");
        questions[1] =new  Question("Հովհաննես Շիրազ <<Քեզ կուլ կտան մուղամները, բառդ կառնեն, վայ ․․․․․․․․>>",
                "Ադանա", "Պոլսահայ","Ղարաբաղ","Հայաստան", "c");
        questions[2] =new  Question("Որը Ջեկ Լոնդոնի ստեղծագործություններից չէ",
                "Փայտոջիլ ", "Երկաթե Կրունկ","Սպիտակ ժանիքը","Արևի որդին", "a");
        questions[3] =new  Question("Առանց կանոնների մենամարտ-ի մրցումներն անցկացվում են այդ հարթակում",
                "Ագոն", "Սեպտագոն", "Օկտագոն","Պենտագոն", "c");
        questions[4] =new  Question("Վան Մարվուկն այդ գազը հայնաբերեց 17-րդ դարում, իսկ Շյոնբբրենն այն անվանեց <<հոտավետ>>, այսինք ՝ ․․․․․․",
                "Օզոն", "Շմոլ", "Իպրիտ","Ֆոսգեն", "a");
        questions[5] =new  Question("Արևելյան ծագում ունեցող հնագույն գործիք, որը բառացի նշանակում է <<բազմաթիվ թմբուկներ>>",
                "Ցիմբալ", "Չելեստա", "Տամտամ","Լիտավր", "d");
        questions[6] =new  Question("Կենդանիներից ամենամեծ բերանն ունի ․․․․․․",
                "Գետաձին", "Կաշալոտը", "Կապույտ կետը","Գրենլանդական կետը", "d");
        questions[7] =new  Question("Ամերիկացի գործարար, ում հիմնած հյուրանոցների ցանցը սփռված է աշխարհում",
                "Հիլթոն", "Համիլթոն", "Միլտոն","Քլինթոն", "a");
        questions[8] =new  Question("Nervus facialis-ը որ նյարդն է",
                "Մկանային", "Դիմային", "Նստատեղի"," Երկաթյա", "b");
        questions[9] =new  Question("Այս էքստրեմալ մարզաձևերից մեկում <<չեն օգտվում>> քամու ծառայությունից",
                "Վինդսերֆինգ", "Կայտսերֆինգ", "Սնոուկայտինգ","Սնոուբորդինգ", "d");
        return questions;
    }
    public static Question random_question_12(){
        Random rand = new Random();
        int index = rand.nextInt(10);
        System.out.println("Տասներկուերորդ հարց, 1000000 դրամ\n");
        return question_12_array()[index];
    }
}